In [10]:
import pandas as pd
import sqlite3

In [11]:
conn = sqlite3.connect("database_proyecto.db")
cursor = conn.cursor()

In [12]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS alumnos (
    id_alumno INTEGER PRIMARY KEY,
    nombre TEXT,
    email TEXT,
    promocion TEXT,
    fecha_comienzo TEXT,
    campus TEXT,
    vertical TEXT
)
''')
conn.commit()

In [ ]:
csv_path = "alumnos.csv"  
df = pd.read_csv(csv_path)

In [ ]:
# Eliminar duplicados en id_alumno
df = df.drop_duplicates(subset=['id_alumno'])

# Convertir a lista de tuplas
data = list(df.itertuples(index=False, name=None))

In [15]:
cursor.executemany('''
    INSERT OR IGNORE INTO alumnos
    (id_alumno, nombre, email, promocion, fecha_comienzo, campus, vertical)
    VALUES (?, ?, ?, ?, ?, ?, ?)
''', data)
conn.commit()

In [16]:
def sql_query(query):
    return pd.read_sql(query, conn)

# Mostrar primeras filas
print(sql_query("SELECT * FROM alumnos LIMIT 5"))

# Contar total de registros
print(sql_query("SELECT COUNT(*) AS total FROM alumnos"))

   id_alumno            nombre                       email   promocion  \
0          1      Jafet Casals      Jafet_Casals@gmail.com  Septiembre
1          2  Jorge Manzanares  Jorge_Manzanares@gmail.com  Septiembre
2          3     Onofre Adadia     Onofre_Adadia@gmail.com  Septiembre
3          4      Merche Prada      Merche_Prada@gmail.com  Septiembre
4          5      Pilar Abella      Pilar_Abella@gmail.com  Septiembre

  fecha_comienzo  campus vertical
0     2023-09-18  Madrid       DS
1     2023-09-18  Madrid       DS
2     2023-09-18  Madrid       DS
3     2023-09-18  Madrid       DS
4     2023-09-18  Madrid       DS
   total
0     52

In [24]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS profesores (
    id_profesor INTEGER PRIMARY KEY,
    nombre TEXT,
    rol TEXT,
    vertical TEXT,
    promocion TEXT,
    campus TEXT,
    modalidad TEXT
)
''')
conn.commit()

In [ ]:
csv_path = "profesores.csv"  
df = pd.read_csv(csv_path)

In [19]:
# Eliminar duplicados en id_alumno
df = df.drop_duplicates(subset=['id_profesor'])

# Convertir a lista de tuplas
data = list(df.itertuples(index=False, name=None))

In [25]:
cursor.executemany('''
    INSERT OR IGNORE INTO profesores
    (id_profesor, nombre, rol, vertical, promocion, campus, modalidad)
    VALUES (?, ?, ?, ?, ?, ?, ?)
''', data)
conn.commit()

In [26]:
def sql_query(query):
    return pd.read_sql(query, conn)

# Mostrar primeras filas
print(sql_query("SELECT * FROM alumnos LIMIT 5"))

# Contar total de registros
print(sql_query("SELECT COUNT(*) AS total FROM alumnos"))

   id_alumno            nombre                       email   promocion  \
0          1      Jafet Casals      Jafet_Casals@gmail.com  Septiembre
1          2  Jorge Manzanares  Jorge_Manzanares@gmail.com  Septiembre
2          3     Onofre Adadia     Onofre_Adadia@gmail.com  Septiembre
3          4      Merche Prada      Merche_Prada@gmail.com  Septiembre
4          5      Pilar Abella      Pilar_Abella@gmail.com  Septiembre

  fecha_comienzo  campus vertical
0     2023-09-18  Madrid       DS
1     2023-09-18  Madrid       DS
2     2023-09-18  Madrid       DS
3     2023-09-18  Madrid       DS
4     2023-09-18  Madrid       DS
   total
0     52

In [ ]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS proyectos (
    id_proyecto INTEGER PRIMARY KEY,
    nombre_proyecto
    vertical
)
''')
conn.commit()

In [ ]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS alumno_proyecto (
    id_alumno INTEGER,
    id_proyecto INTEGER,
    calificacion TEXT,
    FOREIGN KEY (id_alumno) REFERENCES alumnos(id_alumno)
    FOREIGN KEY (id_proyecto) REFERENCES alumnos(id_proyecto)
)
''')
conn.commit()